       IDENTIFICATION          DIVISION.
       PROGRAM-ID. CLIENTES.
       ENVIRONMENT             DIVISION.
       DATA                    DIVISION.
       PROCEDURE               DIVISION.
           DISPLAY "Clientes".
           STOP RUN.