       IDENTIFICATION          DIVISION.
       PROGRAM-ID. PROCESSOR.
       PROCEDURE               DIVISION.
           DISPLAY "OLA COBOL!".
           STOP RUN.
      